# Used cars price prediction - Ironhack midterm project

## 1. EDA

In [1]:
import pandas as pd
import numpy as np
import statistics as stats
import seaborn as sns
import matplotlib.pyplot as plt
import math
from sklearn.preprocessing import PowerTransformer, StandardScaler, minmax_scale, OneHotEncoder
%matplotlib inline

from scipy.stats import iqr
from sklearn.compose import ColumnTransformer
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
import statsmodels.api as sm

from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error as mse
from sklearn.metrics import mean_absolute_error as mae

#### EDA results:

* 'car data.csv' has anomalies in feature values; the file is ignored in the analysis due to its low statistical value with only 300 rows.
* 'model' and 'engine' categorical columns have too many unique values; these columns will be ignored for the final data set due to the amount of dummified columns they would create after normalizing the data.
* 'seats' column has nine unique values and will be used as the closest present alternative to vehicle type.
* in order to concatenate the csv files into one dataframe columns 'location', 'color', 'mileage', 'max power', 'max torque', 'drivetrain', 'length', 'width', 'height', 'fuel tank capacity' will be ignored, since they are not present in each file.
* concatenating three csv files will result in a dataframe with roughly over 14k observations.
* no outliers require removal.

In [2]:
df1 = pd.read_csv('./data/CAR DETAILS FROM CAR DEKHO.csv')
df2 = pd.read_csv('./data/Car details v3.csv')
df3 = pd.read_csv('./data/car details v4.csv')

In [3]:
#df3.iloc[df3['Price'].idxmax()]  # <--- shows that the outliers should not be removed

In [4]:
df3.describe().round()

,Price,Year,Kilometer,Length,Width,Height,Seating Capacity,Fuel Tank Capacity
count,2059.0,2059.0,2059.0,1995.0,1995.0,1995.0,1995.0,1946.0
mean,1702992.0,2016.0,54225.0,4281.0,1768.0,1592.0,5.0,52.0
std,2419881.0,3.0,57362.0,442.0,135.0,136.0,1.0,15.0
min,49000.0,1988.0,0.0,3099.0,1475.0,1165.0,2.0,15.0
25%,484999.0,2014.0,29000.0,3985.0,1695.0,1485.0,5.0,41.0
50%,825000.0,2017.0,50000.0,4370.0,1770.0,1545.0,5.0,50.0
75%,1925000.0,2019.0,72000.0,4629.0,1832.0,1675.0,5.0,60.0
max,35000000.0,2022.0,2000000.0,5569.0,2220.0,1995.0,8.0,105.0

## 2. Data cleaning

#### data cleaning results:
* extracted the first word (Make) in the 'name' and 'owner' columns.

In [5]:
df1['name'] = df1['name'].apply(lambda x: x.split()[0])
df2['name'] = df2['name'].apply(lambda x: x.split()[0])

In [6]:
df1['owner'] = df1['owner'].apply(lambda x: x.split()[0])
df2['owner'] = df2['owner'].apply(lambda x: x.split()[0])

In [7]:
df3.rename(columns=
           {"Year": "year",
            "Price": "selling_price",
            "Kilometer": "km_driven", 
            "Fuel Type": "fuel", 
            "Seller Type": "seller_type", 
            "Transmission": "transmission", 
            "Make": "name",
            "Owner": "owner"},inplace=True)

df1["selling_price"] /= 100
df1["selling_price"] = df1["selling_price"].astype(int)

df2["selling_price"] /= 100
df2["selling_price"] = df2["selling_price"].astype(int)

df3["selling_price"] /= 100
df3["selling_price"] = df3["selling_price"].astype(int)

In [8]:
df1.head(1)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti,2007,600,70000,Petrol,Individual,Manual,First

In [9]:
df2.head(1)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,torque,seats
0,Maruti,2014,4500,145500,Diesel,Individual,Manual,First,23.4 kmpl,1248 CC,74 bhp,190Nm@ 2000rpm,5.0

In [10]:
df3.head(1)

,name,Model,selling_price,year,km_driven,fuel,transmission,Location,Color,owner,seller_type,Engine,Max Power,Max Torque,Drivetrain,Length,Width,Height,Seating Capacity,Fuel Tank Capacity
0,Honda,Amaze 1.2 VX i-VTEC,5050,2017,87150,Petrol,Manual,Pune,Grey,First,Corporate,1198 cc,87 bhp @ 6000 rpm,109 Nm @ 4500 rpm,FWD,3990.0,1680.0,1505.0,5.0,35.0

In [11]:
df2.drop(['mileage', 'engine', 'max_power', 'torque', 'seats'], axis=1, inplace=True)
df3.drop(['Model', 'Location', 'Color', 'Engine', 'Max Power', 'Max Torque', 
          'Drivetrain', 'Length', 'Width', 'Height', 'Seating Capacity', 'Fuel Tank Capacity'], axis=1, inplace=True)

In [12]:
df1.head(1)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti,2007,600,70000,Petrol,Individual,Manual,First

In [13]:
df2.head(1)

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti,2014,4500,145500,Diesel,Individual,Manual,First

In [14]:
df3.head(1)

,name,selling_price,year,km_driven,fuel,transmission,owner,seller_type
0,Honda,5050,2017,87150,Petrol,Manual,First,Corporate

In [15]:
df = pd.concat([df1, df2, df3], ignore_index=True)

In [16]:
df

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti,2007,600,70000,Petrol,Individual,Manual,First
1,Maruti,2007,1350,50000,Petrol,Individual,Manual,First
2,Hyundai,2012,6000,100000,Diesel,Individual,Manual,First
3,Datsun,2017,2500,46000,Petrol,Individual,Manual,First
4,Honda,2014,4500,141000,Diesel,Individual,Manual,Second
...,...,...,...,...,...,...,...,...
14522,Mahindra,2016,8500,90300,Diesel,Individual,Manual,First
14523,Hyundai,2014,2750,83000,Petrol,Individual,Manual,Second
14524,Ford,2013,2400,73000,Petrol,Individual,Manual,First
14525,BMW,2018,42900,60474,Diesel,Individual,Automatic,First
14526,Mahindra,2017,6700,72000,Diesel,Individual,Manual,First